run/pdfSimpleFoam/mixingLayer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293;

boundaryField
{
    upperInlet
    {
        type            fixedValue;
        value           uniform 293;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform 293;
    }
    walls
    {
        type            fixedValue;
        value           uniform 293;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
