run/pdfSimpleFoam/mixingLayer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 20 0 0 );

boundaryField
{
    upperInlet
    {
        type            fixedValue;
        value           uniform ( 30 0 0 );
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform ( 20 0 0 );
    }
    walls
    {
        type            slip;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
