run/pdfSimpleFoam/mixingLayer/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 6;

boundaryField
{
    lowerInlet
    {
        type            fixedValue;
        value           uniform 6;
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform 13.5;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            slip;
    }
}


// ************************************************************************* //
