run/pdfSimpleFoam/mixingLayer/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0 0 0)   //  0
    ( 6 0 0)   //  1
    ( 6 1 0)   //  2
    ( 0 1 0)   //  3
    ( 6 2 0)   //  4
    ( 0 2 0)   //  5

    ( 0 0 2)   //  6
    ( 6 0 2)   //  7
    ( 6 1 2)   //  8
    ( 0 1 2)   //  9
    ( 6 2 2)   // 10
    ( 0 2 2)   // 11
);

blocks
(
    hex (0 1 2 3 6 7  8  9) (40 10 1) simpleGrading (1 1 1)
    hex (3 2 4 5 9 8 10 11) (40 10 1) simpleGrading (1 1 1)
);

edges
(
);

/*
               5                                4
             +--------------------------------+
            /.                               /|
           / . 3                            / | 2
          /  +............................./..+      y
         /  ..                            /  /|      |
        /  . . 0                         /  / | 1    |
       /  .  +........................../../..+      +-----x
      +--------------------------------+  /  /      /
   11 | .  .                        10 | /  /      z
      |.  .                            |/  /
      +--------------------------------+  /
    9 | .                            8 | /
      |.                               |/
      +--------------------------------+
    6                                7

 */

patches
(
    patch lowerInlet
    (
        (0 6 9 3)
    )
    patch upperInlet
    (
        (3 9 11 5)
    )
    patch outlet
    (
        (1 2  8 7)
        (2 4 10 8)
    )
    patch walls
    (
        (0 1  7  6)
        (4 5 11 10)
        (1 0  3  2)
        (2 3  5  4)
        (6 7  8  9)
        (9 8 10 11)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
