run/pdfSimpleFoam/mixingLayer/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

evolutionFrequency 1;

cloudProperties
{
    averageTimeScale      1;
    particlesPerCell      50;
    particleNumberControl on;
    cloneAt               0.9;
    inoutPatches
    (
        lowerInlet
        upperInlet
        outlet
    );
}

// ************************************************************************* //
